CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_tzpcu.h
/* TZPCU_TZIAC_INTEN2 */
#define TZPCU_TZIAC_INTEN2_TZSPCIE            BIT(0)                            /*!< TZSPC illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_TZIACIE            BIT(1)                            /*!< TZIAC illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_SRAM0IE            BIT(4)                            /*!< SRAM0 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_TZBMPC0_REGIE      BIT(5)                            /*!< TZBMPC0_REG illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_SRAM1IE            BIT(6)                            /*!< SRAM1 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_TZBMPC1_REGIE      BIT(7)                            /*!< TZBMPC1_REG illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_SRAM2IE            BIT(8)                            /*!< SRAM2 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_TZBMPC2_REGIE      BIT(9)                            /*!< TZBMPC2_REG illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_SRAM3IE            BIT(10)                           /*!< SRAM3 illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_TZBMPC3_REGIE      BIT(11)                           /*!< TZBMPC3_REG illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_EFUSEIE            BIT(23)                           /*!< EFUSE illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_SQPI_PSRAMIE       BIT(24)                           /*!< SQPI_PSRAM illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_QSPI_FLASHIE       BIT(25)                           /*!< QSPI_FLASH illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_SQPI_PSRAMREGIE    BIT(26)                           /*!< SQPI PSRAMREG illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_QSPI_FLASHREGIE    BIT(27)                           /*!< QSPI FLASHREG illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_WIFI_RFIE          BIT(28)                           /*!< WIFI RF illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_I2S1_ADDIE         BIT(29)                           /*!< I2S1_ADD illegal access interrupt enable bit */
#define TZPCU_TZIAC_INTEN2_DCIIE              BIT(30)                           /*!< DCI illegal access interrupt enable bit(not support on GD32W515TX series devices) */
#define TZPCU_TZIAC_INTEN2_WIFIIE             BIT(31)                           /*!< WIFI illegal access interrupt enable bit */

/* TZPCU_TZIAC_STAT0 */
#define TZPCU_TZIAC_STAT0_TIMER1IAF           BIT(0)                            /*!< TIMER1 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_TIMER2IAF           BIT(1)                            /*!< TIMER2 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_TIMER3IAF           BIT(2)                            /*!< TIMER3 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_TIMER4IAF           BIT(3)                            /*!< TIMER4 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_TIMER5IAF           BIT(4)                            /*!< TIMER5 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_WWDGTIAF            BIT(6)                            /*!< WWDGT illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_FWDGTIAF            BIT(7)                            /*!< FWDGT illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_SPI1IAF             BIT(8)                            /*!< SPI1 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_USART1IAF           BIT(10)                           /*!< USART1 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_USART2IAF           BIT(11)                           /*!< USART2 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_I2C0IAF             BIT(14)                           /*!< I2C0 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_I2C1IAF             BIT(15)                           /*!< I2C1 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_USBFSIAF            BIT(26)                           /*!< USBFS illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_TIMER0IAF           BIT(30)                           /*!< TIMER0 illegal access event flag bit */
#define TZPCU_TZIAC_STAT0_SPI0IAF             BIT(31)                           /*!< SPI0 illegal access event flag bit */

/* TZPCU_TZIAC_STAT1 */
#define TZPCU_TZIAC_STAT1_USART0IAF           BIT(1)                            /*!< USART0 illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_TIMER15IAF          BIT(3)                            /*!< TIMER15 illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_TIMER16IAF          BIT(4)                            /*!< TIMER16 illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_HPDFIAF             BIT(7)                            /*!< HPDF illegal access event flag bit(not support on GD32W515TX series devices) */
#define TZPCU_TZIAC_STAT1_CRCIAF              BIT(8)                            /*!< CRC illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_TSIIAF              BIT(9)                            /*!< TSI illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_ICACHEIAF           BIT(10)                           /*!< ICACHE illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_ADCIAF              BIT(11)                           /*!< ADC illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_CAUIAF              BIT(12)                           /*!< CAU illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_HAUIAF              BIT(13)                           /*!< HAU illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_TRNGIAF             BIT(14)                           /*!< TRNG illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_PKCAUIAF            BIT(15)                           /*!< PKCAU illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_SDIOIAF             BIT(16)                           /*!< SDIO illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_RTCIAF              BIT(19)                           /*!< RTC illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_PMUIAF              BIT(20)                           /*!< PMU illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_SYSCFGIAF           BIT(21)                           /*!< SYSCFG illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_DMA0IAF             BIT(22)                           /*!< DMA0 illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_DMA1IAF             BIT(23)                           /*!< DMA1 illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_RCUIAF              BIT(25)                           /*!< RCU illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_FLASHIAF            BIT(26)                           /*!< FLASH illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_FMCIAF              BIT(27)                           /*!< FMC illegal access event flag bit */
#define TZPCU_TZIAC_STAT1_EXTIIAF             BIT(28)                           /*!< EXTI illegal access event flag bit */

/* TZPCU_TZIAC_STAT2 */
#define TZPCU_TZIAC_STAT2_TZSPCIAF            BIT(0)                            /*!< TZSPC illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_TZIACIAF            BIT(1)                            /*!< TZIAC illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_SRAM0IAF            BIT(4)                            /*!< SRAM0 illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_TZBMPC0_REGIAF      BIT(5)                            /*!< TZBMPC0_REG illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_SRAM1IAF            BIT(6)                            /*!< SRAM1 illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_TZBMPC1_REGIAF      BIT(7)                            /*!< TZBMPC1_REG illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_SRAM2IAF            BIT(8)                            /*!< SRAM2 illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_TZBMPC2_REGIAF      BIT(9)                            /*!< TZBMPC2_REG illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_SRAM3IAF            BIT(10)                           /*!< SRAM3 illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_TZBMPC3_REGIAF      BIT(11)                           /*!< TZBMPC3_REG illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_EFUSEIAF            BIT(23)                           /*!< EFUSE illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_SQPI_PSRAMIAF       BIT(24)                           /*!< SQPI_PSRAM illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_QSPI_FLASHIAF       BIT(25)                           /*!< QSPI_FLASH illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_SQPI_PSRAMREGIAF    BIT(26)                           /*!< SQPI PSRAMREG illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_QSPI_FLASHREGIAF    BIT(27)                           /*!< QSPI FLASHREG illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_WIFI_RFIAF          BIT(28)                           /*!< WIFI RF illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_I2S1_ADDIAF         BIT(29)                           /*!< I2S1_ADD illegal access event flag bit */
#define TZPCU_TZIAC_STAT2_DCIIAF              BIT(30)                           /*!< DCI illegal access event flag bit(not support on GD32W515TX series devices) */
#define TZPCU_TZIAC_STAT2_WIFIIAF             BIT(31)                           /*!< WIFI illegal access event flag bit */

/* TZPCU_TZIAC_STATC0 */
#define TZPCU_TZIAC_STATC0_TIMER1IAFC         BIT(0)                            /*!< TIMER1 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_TIMER2IAFC         BIT(1)                            /*!< TIMER2 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_TIMER3IAFC         BIT(2)                            /*!< TIMER3 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_TIMER4IAFC         BIT(3)                            /*!< TIMER4 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_TIMER5IAFC         BIT(4)                            /*!< TIMER5 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_WWDGTIAFC          BIT(6)                            /*!< WWDGT illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_FWDGTIAFC          BIT(7)                            /*!< FWDGT illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_SPI1IAFC           BIT(8)                            /*!< SPI1 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_USART1IAFC         BIT(10)                           /*!< USART1 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_USART2IAFC         BIT(11)                           /*!< USART2 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_I2C0IAFC           BIT(14)                           /*!< I2C0 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_I2C1IAFC           BIT(15)                           /*!< I2C1 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_USBFSIAFC          BIT(26)                           /*!< USBFS illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_TIMER0IAFC         BIT(30)                           /*!< TIMER0 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC0_SPI0IAFC           BIT(31)                           /*!< SPI0 illegal access flag clear bit */

