CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_tzpcu.h
/* TZPCU_TZIAC_STATC1 */
#define TZPCU_TZIAC_STATC1_USART0IAFC         BIT(1)                            /*!< USART0 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_TIMER15IAFC        BIT(3)                            /*!< TIMER15 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_TIMER16IAFC        BIT(4)                            /*!< TIMER16 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_HPDFIAFC           BIT(7)                            /*!< HPDF illegal access flag clear bit(not support on GD32W515TX series devices) */
#define TZPCU_TZIAC_STATC1_CRCIAFC            BIT(8)                            /*!< CRC illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_TSIIAFC            BIT(9)                            /*!< TSI illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_ICACHEIAFC         BIT(10)                           /*!< ICACHE illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_ADCIAFC            BIT(11)                           /*!< ADC illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_CAUIAFC            BIT(12)                           /*!< CAU illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_HAUIAFC            BIT(13)                           /*!< HAU illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_TRNGIAFC           BIT(14)                           /*!< TRNG illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_PKCAUIAFC          BIT(15)                           /*!< PKCAU illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_SDIOIAFC           BIT(16)                           /*!< SDIO illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_RTCIAFC            BIT(19)                           /*!< RTC illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_PMUIAFC            BIT(20)                           /*!< PMU illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_SYSCFGIAFC         BIT(21)                           /*!< SYSCFG illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_DMA0IAFC           BIT(22)                           /*!< DMA0 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_DMA1IAFC           BIT(23)                           /*!< DMA1 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_RCUIAFC            BIT(25)                           /*!< RCU illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_FLASHIAFC          BIT(26)                           /*!< FLASH illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_FMCIAFC            BIT(27)                           /*!< FMC illegal access flag clear bit */
#define TZPCU_TZIAC_STATC1_EXTIIAFC           BIT(28)                           /*!< EXTI illegal access flag clear bit */

/* TZPCU_TZIAC_STATC2 */
#define TZPCU_TZIAC_STATC2_TZSPCIAFC          BIT(0)                            /*!< TZSPC illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_TZIACIAFC          BIT(1)                            /*!< TZIAC illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_SRAM0IAFC          BIT(4)                            /*!< SRAM0 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_TZBMPC0_REGIAFC    BIT(5)                            /*!< TZBMPC0_REG illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_SRAM1IAFC          BIT(6)                            /*!< SRAM1 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_TZBMPC1_REGIAFC    BIT(7)                            /*!< TZBMPC1_REG illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_SRAM2IAFC          BIT(8)                            /*!< SRAM2 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_TZBMPC2_REGIAFC    BIT(9)                            /*!< TZBMPC2_REG illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_SRAM3IAFC          BIT(10)                           /*!< SRAM3 illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_TZBMPC3_REGIAFC    BIT(11)                           /*!< TZBMPC3_REG illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_EFUSEIAFC          BIT(23)                           /*!< EFUSE illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_SQPI_PSRAMIAFC     BIT(24)                           /*!< SQPI_PSRAM illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_QSPI_FLASHIAFC     BIT(25)                           /*!< QSPI_FLASH illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_SQPI_PSRAMREGIAFC  BIT(26)                           /*!< SQPI PSRAMREG illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_QSPI_FLASHREGIAFC  BIT(27)                           /*!< QSPI FLASHREG illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_WIFI_RFIAFC        BIT(28)                           /*!< WIFI RF illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_I2S1_ADDIAFC       BIT(29)                           /*!< I2S1_ADD illegal access flag clear bit */
#define TZPCU_TZIAC_STATC2_DCIIAFC            BIT(30)                           /*!< DCI illegal access flag clear bit(not support on GD32W515TX series devices) */
#define TZPCU_TZIAC_STATC2_WIFIIAFC           BIT(31)                           /*!< WIFI illegal access flag clear bit */

/* constants definitions */
/* peripherals position definitions */
#define TZPCU_PERIPH_TIMER1                  (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_TIMER1IE)                                      /*!< TIMER1 peripheral definitions */
#define TZPCU_PERIPH_TIMER2                  (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_TIMER2IE)                                      /*!< TIMER2 peripheral definitions */
#define TZPCU_PERIPH_TIMER3                  (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_TIMER3IE)                                      /*!< TIMER3 peripheral definitions */
#define TZPCU_PERIPH_TIMER4                  (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_TIMER4IE)                                      /*!< TIMER4 peripheral definitions */
#define TZPCU_PERIPH_TIMER5                  (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_TIMER5IE)                                      /*!< TIMER5 peripheral definitions */
#define TZPCU_PERIPH_WWDGT                   (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_WWDGTIE)                                       /*!< WWDGT peripheral definitions */
#define TZPCU_PERIPH_FWDGT                   (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_FWDGTIE)                                       /*!< FWDGT peripheral definitions */
#define TZPCU_PERIPH_SPI1                    (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_SPI1IE)                                        /*!< SPI1 peripheral definitions */
#define TZPCU_PERIPH_USART1                  (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_USART1IE)                                      /*!< USART1 peripheral definitions */
#define TZPCU_PERIPH_USART2                  (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_USART2IE)                                      /*!< USART2 peripheral definitions */
#define TZPCU_PERIPH_I2C0                    (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_I2C0IE)                                        /*!< I2C0 peripheral definitions */
#define TZPCU_PERIPH_I2C1                    (((uint32_t)0x00000000U) | TZPCU_TZIAC_INTEN0_I2C1IE)                                        /*!< I2C1 peripheral definitions */
#define TZPCU_PERIPH_USBFS                   (((uint32_t)0x00200000U) | (TZPCU_TZIAC_INTEN0_USBFSIE >> 16))                               /*!< USBFS peripheral definitions */
#define TZPCU_PERIPH_TIMER0                  (((uint32_t)0x00200000U) | (TZPCU_TZIAC_INTEN0_TIMER0IE >> 16))                              /*!< TIMER0 peripheral definitions */
#define TZPCU_PERIPH_SPI0                    (((uint32_t)0x00200000U) | (TZPCU_TZIAC_INTEN0_SPI0IE >> 16))                                /*!< SPI0 peripheral definitions */
#define TZPCU_PERIPH_USART0                  (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_USART0IE)                                      /*!< USART0 peripheral definitions */
#define TZPCU_PERIPH_TIMER15                 (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_TIMER15IE)                                     /*!< TIMER15 peripheral definitions */
#define TZPCU_PERIPH_TIMER16                 (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_TIMER16IE)                                     /*!< TIMER16 peripheral definitions */
#define TZPCU_PERIPH_HPDF                    (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_HPDFIE)                                        /*!< HPDF peripheral definitions(not support on GD32W515TX series devices) */
#define TZPCU_PERIPH_CRC                     (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_CRCIE)                                         /*!< CRC peripheral definitions */
#define TZPCU_PERIPH_TSI                     (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_TSIIE)                                         /*!< TSI peripheral definitions */
#define TZPCU_PERIPH_ICACHE                  (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_ICACHEIE)                                      /*!< ICACHE peripheral definitions */
#define TZPCU_PERIPH_ADC                     (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_ADCIE)                                         /*!< ADC peripheral definitions */
#define TZPCU_PERIPH_CAU                     (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_CAUIE)                                         /*!< CAU peripheral definitions */
#define TZPCU_PERIPH_HAU                     (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_HAUIE)                                         /*!< HAU peripheral definitions */
#define TZPCU_PERIPH_TRNG                    (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_TRNGIE)                                        /*!< TRNG peripheral definitions */
#define TZPCU_PERIPH_PKCAU                   (((uint32_t)0x10000000U) | TZPCU_TZIAC_INTEN1_PKCAUIE)                                       /*!< PKCAU peripheral definitions */
#define TZPCU_PERIPH_SDIO                    (((uint32_t)0x10200000U) | (TZPCU_TZIAC_INTEN1_SDIOIE >> 16))                                /*!< SDIO peripheral definitions */
#define TZPCU_PERIPH_RTC                     (((uint32_t)0x10200000U) | (TZPCU_TZIAC_INTEN1_RTCIE >> 16))                                 /*!< RTC peripheral definitions */
#define TZPCU_PERIPH_PMU                     (((uint32_t)0x10200000U) | (TZPCU_TZIAC_INTEN1_PMUIE >> 16))                                 /*!< PMU peripheral definitions */
#define TZPCU_PERIPH_SYSCFG                  (((uint32_t)0x10200000U) | (TZPCU_TZIAC_INTEN1_SYSCFGIE >> 16))                              /*!< SYSCFG peripheral definitions */
#define TZPCU_PERIPH_DMA0                    (((uint32_t)0x10200000U) | (TZPCU_TZIAC_INTEN1_DMA0IE >> 16))                                /*!< DMA0 peripheral definitions */
#define TZPCU_PERIPH_DMA1                    (((uint32_t)0x10200000U) | (TZPCU_TZIAC_INTEN1_DMA1IE >> 16))                                /*!< DMA1 peripheral definitions */
#define TZPCU_PERIPH_RCU                     (((uint32_t)0x10200000U) | (TZPCU_TZIAC_INTEN1_RCUIE >> 16))                                 /*!< RCU peripheral definitions */
#define TZPCU_PERIPH_FLASH                   (((uint32_t)0x10200000U) | (TZPCU_TZIAC_INTEN1_FLASHIE >> 16))                               /*!< FLASH peripheral definitions */
#define TZPCU_PERIPH_FMC                     (((uint32_t)0x10200000U) | (TZPCU_TZIAC_INTEN1_FMCIE >> 16))                                 /*!< FMC peripheral definitions */
#define TZPCU_PERIPH_EXTI                    (((uint32_t)0x10200000U) | (TZPCU_TZIAC_INTEN1_EXTIIE >> 16))                                /*!< EXTI peripheral definitions */
#define TZPCU_PERIPH_TZSPC                   (((uint32_t)0x20000000U) | TZPCU_TZIAC_INTEN2_TZSPCIE)                                       /*!< TZSPC peripheral definitions */
#define TZPCU_PERIPH_TZIAC                   (((uint32_t)0x20000000U) | TZPCU_TZIAC_INTEN2_TZIACIE)                                       /*!< TZIAC peripheral definitions */
#define TZPCU_PERIPH_SRAM0                   (((uint32_t)0x20000000U) | TZPCU_TZIAC_INTEN2_SRAM0IE)                                       /*!< SRAM0 peripheral definitions */
#define TZPCU_PERIPH_TZBMPC0_REG             (((uint32_t)0x20000000U) | TZPCU_TZIAC_INTEN2_TZBMPC0_REGIE)                                 /*!< TZBMPC0_REG peripheral definitions */
#define TZPCU_PERIPH_SRAM1                   (((uint32_t)0x20000000U) | TZPCU_TZIAC_INTEN2_SRAM1IE)                                       /*!< SRAM1 peripheral definitions */
#define TZPCU_PERIPH_TZBMPC1_REG             (((uint32_t)0x20000000U) | TZPCU_TZIAC_INTEN2_TZBMPC1_REGIE)                                 /*!< TZBMPC1_REG peripheral definitions */
#define TZPCU_PERIPH_SRAM2                   (((uint32_t)0x20000000U) | TZPCU_TZIAC_INTEN2_SRAM2IE)                                       /*!< SRAM2 peripheral definitions */
#define TZPCU_PERIPH_TZBMPC2_REG             (((uint32_t)0x20000000U) | TZPCU_TZIAC_INTEN2_TZBMPC2_REGIE)                                 /*!< TZBMPC2_REG peripheral definitions */
#define TZPCU_PERIPH_SRAM3                   (((uint32_t)0x20000000U) | TZPCU_TZIAC_INTEN2_SRAM3IE)                                       /*!< SRAM3 peripheral definitions */
#define TZPCU_PERIPH_TZBMPC3_REG             (((uint32_t)0x20000000U) | TZPCU_TZIAC_INTEN2_TZBMPC3_REGIE)                                 /*!< TZBMPC3_REG peripheral definitions */
#define TZPCU_PERIPH_EFUSE                   (((uint32_t)0x20200000U) | (TZPCU_TZIAC_INTEN2_EFUSEIE >> 16))                               /*!< EFUSE peripheral definitions */
#define TZPCU_PERIPH_SQPI_PSRAM              (((uint32_t)0x20200000U) | (TZPCU_TZIAC_INTEN2_SQPI_PSRAMIE >> 16))                          /*!< SQPI_PSRAM peripheral definitions */
#define TZPCU_PERIPH_QSPI_FLASH              (((uint32_t)0x20200000U) | (TZPCU_TZIAC_INTEN2_QSPI_FLASHIE >> 16))                          /*!< QSPI_FLASH peripheral definitions */
#define TZPCU_PERIPH_DBG                     (((uint32_t)0x20200000U) | (BIT(25) >> 16))                                                  /*!< DBG peripheral definitions */
#define TZPCU_PERIPH_SQPI_PSRAMREG           (((uint32_t)0x20200000U) | (TZPCU_TZIAC_INTEN2_SQPI_PSRAMREGIE >> 16))                       /*!< SQPI PSRAMREG peripheral definitions */
#define TZPCU_PERIPH_QSPI_FLASHREG           (((uint32_t)0x20200000U) | (TZPCU_TZIAC_INTEN2_QSPI_FLASHREGIE >> 16))                       /*!< QSPI FLASHREG peripheral definitions */
#define TZPCU_PERIPH_WIFI_RF                 (((uint32_t)0x20200000U) | (TZPCU_TZIAC_INTEN2_WIFI_RFIE >> 16))                             /*!< WIFI RF peripheral definitions */
#define TZPCU_PERIPH_I2S1_ADD                (((uint32_t)0x20200000U) | (TZPCU_TZIAC_INTEN2_I2S1_ADDIE  >> 16))                           /*!< I2S1_ADD peripheral definitions */
#define TZPCU_PERIPH_DCI                     (((uint32_t)0x20200000U) | (TZPCU_TZIAC_INTEN2_DCIIE >> 16))                                 /*!< DCI peripheral definitions(not support on GD32W515TX series devices) */
#define TZPCU_PERIPH_WIFI                    (((uint32_t)0x20200000U) | (TZPCU_TZIAC_INTEN2_WIFIIE >> 16))                                /*!< WIFI peripheral definitions */
#define TZPCU_PERIPH_ALL                     BIT(22)                                                                                      /*!< all peripheral definitions */

