CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_tzpcu.h
/* peripherals illegal access interrupt flag definitions, used for tzpcu_tziac_flag_get and tzpcu_tziac_flag_clear function */
#define TZPCU_TZIAC_FLAG_TIMER1              TZPCU_TZIAC_FLAG_TIMER1                       /*!< TIMER1 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TIMER2              TZPCU_TZIAC_FLAG_TIMER2                       /*!< TIMER2 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TIMER3              TZPCU_TZIAC_FLAG_TIMER3                       /*!< TIMER3 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TIMER4              TZPCU_TZIAC_FLAG_TIMER4                       /*!< TIMER4 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TIMER5              TZPCU_TZIAC_FLAG_TIMER5                       /*!< TIMER5 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_WWDGT               TZPCU_TZIAC_FLAG_WWDGT                        /*!< WWDGT peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_FWDGT               TZPCU_TZIAC_FLAG_FWDGT                        /*!< FWDGT peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SPI1                TZPCU_TZIAC_FLAG_SPI1                         /*!< SPI1 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_USART1              TZPCU_TZIAC_FLAG_USART1                       /*!< USART1 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_USART2              TZPCU_TZIAC_FLAG_USART2                       /*!< USART2 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_I2C0                TZPCU_TZIAC_FLAG_I2C0                         /*!< I2C0 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_I2C1                TZPCU_TZIAC_FLAG_I2C1                         /*!< I2C1 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_USBFS               TZPCU_TZIAC_FLAG_USBFS                        /*!< USBFS peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TIMER0              TZPCU_TZIAC_FLAG_TIMER0                       /*!< TIMER0 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SPI0                TZPCU_TZIAC_FLAG_SPI0                         /*!< SPI0 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_USART0              TZPCU_TZIAC_FLAG_USART0                       /*!< USART0 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TIMER15             TZPCU_TZIAC_FLAG_TIMER15                      /*!< TIMER15 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TIMER16             TZPCU_TZIAC_FLAG_TIMER16                      /*!< TIMER16 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_HPDF                TZPCU_TZIAC_FLAG_HPDF                         /*!< HPDF peripheral llegal access interrupt flag definitions(not support on GD32W515TX series devices) */
#define TZPCU_TZIAC_FLAG_CRC                 TZPCU_TZIAC_FLAG_CRC                          /*!< CRC peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TSI                 TZPCU_TZIAC_FLAG_TSI                          /*!< TSI peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_ICACHE              TZPCU_TZIAC_FLAG_ICACHE                       /*!< ICACHE peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_ADC                 TZPCU_TZIAC_FLAG_ADC                          /*!< ADC peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_CAU                 TZPCU_TZIAC_FLAG_CAU                          /*!< CAU peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_HAU                 TZPCU_TZIAC_FLAG_HAU                          /*!< HAU peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TRNG                TZPCU_TZIAC_FLAG_TRNG                         /*!< TRNG peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_PKCAU               TZPCU_TZIAC_FLAG_PKCAU                        /*!< PKCAU peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SDIO                TZPCU_TZIAC_FLAG_SDIO                         /*!< SDIO peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_RTC                 TZPCU_TZIAC_FLAG_RTC                          /*!< RTC peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_PMU                 TZPCU_TZIAC_FLAG_PMU                          /*!< PMU peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SYSCFG              TZPCU_TZIAC_FLAG_SYSCFG                       /*!< SYSCFG peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_DMA0                TZPCU_TZIAC_FLAG_DMA0                         /*!< DMA0 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_DMA1                TZPCU_TZIAC_FLAG_DMA1                         /*!< DMA1 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_RCU                 TZPCU_TZIAC_FLAG_RCU                          /*!< RCU peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_FLASH               TZPCU_TZIAC_FLAG_FLASH                        /*!< FLASH peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_FMC                 TZPCU_TZIAC_FLAG_FMC                          /*!< FMC peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_EXTI                TZPCU_TZIAC_FLAG_EXTI                         /*!< EXTI peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZSPC               TZPCU_TZIAC_FLAG_TZSPC                        /*!< TZSPC peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZIAC               TZPCU_TZIAC_FLAG_TZIAC                        /*!< TZIAC peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SRAM0               TZPCU_TZIAC_FLAG_SRAM0                        /*!< SRAM0 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZBMPC0_REG         TZPCU_TZIAC_FLAG_TZBMPC0_REG                  /*!< TZBMPC0_REG peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SRAM1               TZPCU_TZIAC_FLAG_SRAM1                        /*!< SRAM1 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZBMPC1_REG         TZPCU_TZIAC_FLAG_TZBMPC1_REG                  /*!< TZBMPC1_REG peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SRAM2               TZPCU_TZIAC_FLAG_SRAM2                        /*!< SRAM2 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZBMPC2_REG         TZPCU_TZIAC_FLAG_TZBMPC2_REG                  /*!< TZBMPC2_REG peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SRAM3               TZPCU_TZIAC_FLAG_SRAM3                        /*!< SRAM3 peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_TZBMPC3_REG         TZPCU_TZIAC_FLAG_TZBMPC3_REG                  /*!< TZBMPC3_REG peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_EFUSE               TZPCU_TZIAC_FLAG_EFUSE                        /*!< EFUSE peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SQPI_PSRAM          TZPCU_TZIAC_FLAG_SQPI_PSRAM                   /*!< SQPI_PSRAM peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_QSPI_FLASH          TZPCU_TZIAC_FLAG_QSPI_FLASH                   /*!< QSPI_FLASH peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_SQPI_PSRAMREG       TZPCU_TZIAC_FLAG_SQPI_PSRAMREG                /*!< SQPI PSRAMREG peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_QSPI_FLASHREG       TZPCU_TZIAC_FLAG_QSPI_FLASHREG                /*!< QSPI FLASHREG peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_WIFI_RF             TZPCU_TZIAC_FLAG_WIFI_RF                      /*!< WIFI RF peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_I2S1_ADD            TZPCU_TZIAC_FLAG_I2S1_ADD                     /*!< I2S1_ADD peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_DCI                 TZPCU_TZIAC_FLAG_DCI                          /*!< DCI peripheral llegal access interrupt flag definitions(not support on GD32W515TX series devices) */
#define TZPCU_TZIAC_FLAG_WIFI                TZPCU_TZIAC_FLAG_WIFI                         /*!< WIFI peripheral llegal access interrupt flag definitions */
#define TZPCU_TZIAC_FLAG_ALL                 BIT(22)                                       /*!< all peripheral llegal access interrupt flag definitions  */

/* peripheral attributes definitions */
#define TZPCU_SEC                            (BIT(28) | (uint32_t)0x00000001U)             /*!< peripheral secure attribute */
#define TZPCU_NSEC                           (BIT(28) | (uint32_t)0x00000000U)             /*!< peripheral non-secure attribute */
#define TZPCU_PRIV                           (BIT(29) | (uint32_t)0x00000002U)             /*!< peripheral privilege attribute */
#define TZPCU_NPRIV                          (BIT(29) | (uint32_t)0x00000000U)             /*!< peripheral non-privilege attribute */

