CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_tzpcu.h
/* QSPI flash and SQPI PSRAM configuration flag for non_secure_mark_struct member 'memory_type' */
typedef enum
{
    QSPI_FLASH_MEM = 0U,                                                /*!< QSPI flash memory */
    SQPI_PSRAM_MEM                                                      /*!< SQPI PSRAM memory */
}tzpcu_mem;

/* QSPI flash and SQPI PSRAM non secure mark region flag for non_secure_mark_struct member 'region_number' */
typedef enum
{
    NON_SECURE_MARK_REGION0            = 0U,                            /*!< non secure mark region 0 */
    NON_SECURE_MARK_REGION1,                                            /*!< non secure mark region 1 */
    NON_SECURE_MARK_REGION2,                                            /*!< non secure mark region 2(QSPI flash only) */
    NON_SECURE_MARK_REGION3                                             /*!< non secure mark region 3(QSPI flash only) */
}tzpcu_non_secure_mark_region;

/* structure of external memory non-secure mark */ 
typedef struct
{
    tzpcu_mem memory_type;                                             /*!< memory type, refer to tzpcu_mem */
    tzpcu_non_secure_mark_region region_number;                        /*!< non secure mark region number, refer to tzpcu_non_secure_mark_region */
    uint32_t start_address;                                            /*!< external memory non-secure area start address */
    uint32_t length;                                                   /*!< external memory non-secure area length */
}tzpcu_non_secure_mark_struct;

#define EXT_MEM_GRANULARITY               (0x2000U)                    /*!< granularity of QSPI flash and SQPI PSRAM is 8K */

/* debug type */
#define INVASIVE_DEBUG                    TZPCU_TZSPC_DBG_CFG_IDEN     /*!< invasive debug */
#define NON_INVASIVE_DEBUG                TZPCU_TZSPC_DBG_CFG_NIDEN    /*!< non-invasive debug */
#define SECURE_INVASIVE_DEBUG             TZPCU_TZSPC_DBG_CFG_SPIDEN   /*!< secure invasive debug */
#define SECURE_NON_INVASIVE_DEBUG         TZPCU_TZSPC_DBG_CFG_SPNIDEN  /*!< secure non-Invasive debug */

#define SECURE_ILLEGAL_ACCESS_ENABLE      ((uint32_t)0x00000000U)      /*!< secure read/write access non-secure SRAM is illegal */
#define SECURE_ILLEGAL_ACCESS_DISABLE     ((uint32_t)0x00000000U)      /*!< secure read/write access non-secure SRAM is legal */

/* default security state */
#define DEFAULT_STATE                     ((uint32_t)0x00000000U)      /*!< default state (source clock secured if a secure area exists in the TZBMPC and vice-versa) */
#define INVERT_STATE                      ((uint32_t)0x00000001U)      /*!< invert the state, source clock remains secure even if no secure block is set in the TZBMPC */

/* block secure access mode */
#define BLOCK_SECURE_ACCESS_MODE_SEC      ((uint32_t)0x00000000U)     /*!< block secure access mode is secure */
#define BLOCK_SECURE_ACCESS_MODE_NSEC     ((uint32_t)0x00000001U)     /*!< block secure access mode is non-secure */

/* union block lock configure */
#define UNION_BLOCK_LOCK                  ((uint32_t)0x00000001U)     /*!< lock union block */
#define UNION_BLOCK_UNLOCK                ((uint32_t)0x00000000U)     /*!< unlock union block */

/* illegal access event flag */
#define NO_ILLEGAL_ACCESS_PENDING         ((uint32_t)0x00000000U)     /*!< no illegal access event pending */
#define ILLEGAL_ACCESS_PENDING            ((uint32_t)0x00000001U)     /*!< illegal access event pending */

/* function declarations */
/* TZSPC function */
/* configure peripherals secure attributes */
void tzpcu_tzspc_peripheral_attributes_config(uint32_t periph, uint32_t attributes);
/* get peripherals secure attributes */
uint32_t tzpcu_tzspc_peripheral_attributes_get(uint32_t periph);

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
/* initialize the TZPCU non-secure mark struct with the default values */
void tzpcu_non_secure_mark_struct_para_init(tzpcu_non_secure_mark_struct* init_struct);
/* configure external memory non-secure mark */
ErrStatus tzpcu_tzspc_emnsm_config(tzpcu_non_secure_mark_struct *p_non_secure_mark);
/* lock TZSPC items */
void tzpcu_tzspc_items_lock(void);
/* configure debug type */
void tzpcu_tzspc_dbg_config(uint32_t dbg_type, ControlStatus config_value);
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/* TZBMPC function */
/* lock the control register of the TZBMPC sub-block */
void tzpcu_tzbmpc_lock(uint32_t tzbmpx);
/* configure default security state */
void tzpcu_tzbmpc_security_state_config(uint32_t tzbmpx, uint32_t sec_state);
/* configure secure access state */
void tzpcu_tzbmpc_secure_access_config(uint32_t tzbmpx, uint32_t sec_illaccess_state);
/* configure block secure access mode */
void tzpcu_tzbmpc_block_secure_access_mode_config(uint32_t tzbmpx, uint32_t block_pos_num, uint32_t access_mode);
/* lock configure union block secure access mode */
void tzpcu_tzbmpc_union_block_lock(uint32_t tzbmpx, uint32_t union_block_postion_num);

/* TZIAC function */
/* enable illegal access interrupt */
void tzpcu_tziac_interrupt_enable(uint32_t periph);
/* disable illegal access interrupt */
void tzpcu_tziac_interrupt_disable(uint32_t periph);
/* get illegal access interrupt flag */
uint32_t tzpcu_tziac_flag_get(uint32_t periph_flag);
/* clear illegal access interrupt flag */
void tzpcu_tziac_flag_clear(uint32_t periph_flag);

#endif /* GD32W51X_TZPCU_H */
